<template>
  <div class="hello">
  <img :src="'/IMG_7680.JPG'">
  <h2>豹紋守宮</h2>
  <h4>飼養環境 : </h4>

    <div class="ui container">
      <div class="block">
        <p>飼養豹紋守宮其實非常簡單，只要做好功課就能讓牠在你/妳身旁陪伴好幾年了。首先，需要準備好幾樣飼養上必備的東西，</p>
        <p>飼養箱、加溫墊、底材、躲避屋、鈣粉、水盆以及飼料。這些都準備就緒以後，就可以去帶一隻可愛的守宮回家了。</p>
        <h4>飼養箱 : </h4>
        <p>一般市面上販賣的飼養箱大至上分為兩種，塑膠爬蟲飼養箱與壓克力爬蟲飼養箱，以下介紹兩種飼養箱的優缺點 : </p>
        <p>塑膠飼箱最大的優點就是便宜，不過在觀賞方面比較不美觀，也較難收納；比起塑膠飼養箱，我更推薦使用壓克力飼養箱，</p>
        <p>因為它的四面都是直角，在飼養兩箱以上時不會浪費掉沒必要浪費的空間，再來就是壓克力是完全透明的，非常方便於觀賞</p>
        <p>加溫墊 : </p>
        <p>守宮屬於變溫動物，需要外在的溫度來調節體溫。使用加溫墊在飼養箱中分出冷區與熱區，熱區不用太大，大概佔飼養環境</p>
        <p>的三分之一以下就好，加溫墊的溫度調到30～32之間。加溫墊的使用有兩種說法，一種是冬天再開就好，一種則是全年開著</p>
        <p>我選擇全年開著，因為加溫墊的溫度可以幫助守宮順利消化，再加上加溫墊的耗電量其實非常小。</p>
        <h4>底材 : </h4>
        <p>個人強力推薦使用廚房紙巾當底材，非常方便清潔，也不用擔心誤食，缺點就是看起來很不自然。另外，赤玉土也是個不錯</p>
        <p>的選擇，可以吸掉糞便的味道，不過建議守宮雅成以上在使用赤玉土，以免幼體誤食。</p>
        <h4>食物 : </h4>
        <p>豹紋守宮在野外是以昆蟲為主食，大多數的飼主也都是以活體餵食守宮，例如蟋蟀，麵包蟲或是蟑螂。守宮也是有人工飼料</p>
        <p>但是跟活體飼料比起來其實貴滿多的，在飼養多隻守宮時根本負擔不起，不過還是可以準備一包人工飼料放著，在蟲吃完了</p>
        <p>但是又無法馬上取得新的活餌時餵給守宮。</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'HelloWorld',
  props: {
    msg: String
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>


h3 {
  margin: 40px 0 0;
}
ul {
  list-style-type: none;
  padding: 0;
}
li {
  display: inline-block;
  margin: 0 10px;
}
a {
  color: #42b983;
}
img {
  width: 33%;
}
.ui.container {
  margin: 0 auto;
}

.block {
  max-width: 800px;
  margin: 0 auto;
}
</style>
